{"class_name": "Model", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "name": "input_8", "sparse": false}, "inbound_nodes": [], "name": "input_8"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "name": "input_8", "sparse": false}, "name": "input_8"}, {"class_name": "Flatten", "inbound_nodes": [[["input_8", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_4"}, "name": "flatten_4"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 49, "use_bias": true, "activity_regularizer": null}, "name": "dense_5"}], "input_layers": [["input_8", 0, 0]], "name": "encoder", "output_layers": [["dense_5", 0, 0]]}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "encoder"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 49], "name": "input_9", "sparse": false}, "name": "input_9"}, {"class_name": "Dense", "inbound_nodes": [[["input_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 784, "use_bias": true, "activity_regularizer": null}, "name": "dense_6"}, {"class_name": "Reshape", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "config": {"target_shape": [28, 28, 1], "trainable": true, "name": "reshape_3"}, "name": "reshape_3"}], "input_layers": [["input_9", 0, 0]], "name": "decoder", "output_layers": [["reshape_3", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 0, {}]]], "name": "decoder"}], "input_layers": [["input_8", 0, 0]], "output_layers": [["decoder", 1, 0]], "name": "autoencoder"}, "backend": "tensorflow"}